Revit 2027 API
MetallicPaint.MetallicpaintBaseColor Property
 The property labeled "Color" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetallicpaintBaseColor { get; }
Public Shared ReadOnly Property MetallicpaintBaseColor As String
	Get
public:
static property String^ MetallicpaintBaseColor {
	String^ get ();
}
static member MetallicpaintBaseColor : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace